class Markets7Controller < ApplicationController
    def index
      @markets7 = [
        {
          "圖片": "https://www.cto.moea.gov.tw/Market/upload/store_upload/3326/1622515005_1.jpg",
          "攤商": "玉井跑山雞(51)",
          "服務": "山雞肉質特別Q 彈有勁，提供生、熟食雞肉，是養生料理最佳選擇。",
          "電話": "手機0929536077電話06-3310229",
        },
        {
          "圖片": "https://live.staticflickr.com/65535/51947040919_a3b69910a3_c.jpg",
          "攤商": "玉井跑山雞(51)",
          "服務": "山雞肉質特別Q 彈有勁，提供生、熟食雞肉，是養生料理最佳選擇。",
          "電話": "手機0929536077電話06-3310229",
        },
        {
          "圖片": "https://live.staticflickr.com/65535/51947335325_f9de1ce182_b.jpg",
          "攤商": "玉井跑山雞(51)",
          "服務": "山雞肉質特別Q 彈有勁，提供生、熟食雞肉，是養生料理最佳選擇。",
          "電話": "手機0929536077電話06-3310229",
        },
        {
          "圖片": "https://live.staticflickr.com/65535/51947040889_b5506535da_c.jpg",
          "攤商": "玉井跑山雞(51)",
          "服務": "山雞肉質特別Q 彈有勁，提供生、熟食雞肉，是養生料理最佳選擇。",
          "電話": "手機0929536077電話06-3310229",
        },
        {
          "圖片": "https://live.staticflickr.com/65535/51946801908_afc639327e_c.jpg",
          "攤商": "玉井跑山雞(51)",
          "服務": "山雞肉質特別Q 彈有勁，提供生、熟食雞肉，是養生料理最佳選擇。",
          "電話": "手機0929536077電話06-3310229",
        },
        {
          "圖片": "https://live.staticflickr.com/65535/51945746257_ab506a89bb_c.jpg",
          "攤商": "玉井跑山雞(51)",
          "服務": "山雞肉質特別Q 彈有勁，提供生、熟食雞肉，是養生料理最佳選擇。",
          "電話": "手機0929536077電話06-3310229",
        },
        {
          "圖片": "https://live.staticflickr.com/65535/51946801888_76efdc7680_c.jpg",
          "攤商": "玉井跑山雞(51)",
          "服務": "山雞肉質特別Q 彈有勁，提供生、熟食雞肉，是養生料理最佳選擇。",
          "電話": "手機0929536077電話06-3310229",
        },
        {
          "圖片": "https://live.staticflickr.com/65535/51947040814_9b29b9d1fb_b.jpg",
          "攤商": "玉井跑山雞(51)",
          "服務": "山雞肉質特別Q 彈有勁，提供生、熟食雞肉，是養生料理最佳選擇。",
          "電話": "手機0929536077電話06-3310229",
        },
        {
          "圖片": "https://live.staticflickr.com/65535/51947040809_eaf38bd3b6_b.jpg",
          "攤商": "玉井跑山雞(51)",
          "服務": "山雞肉質特別Q 彈有勁，提供生、熟食雞肉，是養生料理最佳選擇。",
          "電話": "手機0929536077電話06-3310229",
        },
        {
          "圖片": "https://live.staticflickr.com/65535/51947335195_5b42641b50_c.jpg",
          "攤商": "玉井跑山雞(51)",
          "服務": "山雞肉質特別Q 彈有勁，提供生、熟食雞肉，是養生料理最佳選擇。",
          "電話": "手機0929536077電話06-3310229",
        },
        {
          "圖片": "https://live.staticflickr.com/65535/51946728946_edcb19f2cd_c.jpg",
          "攤商": "玉井跑山雞(51)",
          "服務": "山雞肉質特別Q 彈有勁，提供生、熟食雞肉，是養生料理最佳選擇。",
          "電話": "手機0929536077電話06-3310229",
        },

    ]

    @keyword = params[:keyword]

    if @keyword.present?
        @markets7.filter! do |market|
            market[:攤商].include? @keyword
      end
    end
    @markets7 = @markets7.first(12)
  end
end