class Markets35Controller < ApplicationController
    def index
      @markets35 = [
        {
         "圖片": " ",  
         "攤商": "竹炭",
         "服務": "週六(裕平路)\\n隔週",
         "電話": "尚未提供",
        },
        {
         "圖片": " ",  
         "攤商": "泡茶",
         "服務": "週六(裕平路)",
         "電話": "尚未提供",
        },
        {
        "圖片": " ",  
        "攤商": "黑糖糕",
        "服務": "週六(裕平路)",
        "電話": "尚未提供",
        },
        {
        "圖片": " ",  
        "攤商": "機能衣",
        "服務": "週六(裕平路)",
        "電話": "尚未提供",
        },
        {
         "圖片": " ",  
         "攤商": "粉類",
         "服務": "週六(公園)",
         "電話": "尚未提供",
        },
        {
         "圖片": " ",  
         "攤商": "糖炒栗子",
         "服務": "週六(公園)",
         "電話": "尚未提供",
        },
        {
         "圖片": " ",  
         "攤商": "女裝",
         "服務": "週六(公園)",
         "電話": "尚未提供",
        },
        {
        "圖片": "https://live.staticflickr.com/65535/51887834555_2d28756ca3_b.jpg",  
        "攤商": "南投山藥",
        "服務": "週六(公園)\\n自產自銷\\n隔週",
        "電話": "尚未提供",
        },
  
    ]

    @keyword = params[:keyword]

    if @keyword.present?
        @markets35.filter! do |market|
            market[:攤商].include? @keyword
      end
    end
    @markets35 = @markets35.first(12)
  end
end